START_MESSAGE = """
🐸 Привет, я TodoFrog — ваш удобный инструмент в борьбе с прокрастинацией!

*Идея крайне проста:*

1️⃣ Каждое утро планируйте *до 5 небольших задач* — они займут у вас *не больше 15 минут каждая*.

2️⃣ Выполняйте их в удобном порядке.

3️⃣ Пропустили что-то? Ничего страшного — задачи превратятся в лягушку и плавно "перепрыгнут" на следующий день. Но не злоупотребляйте пропуском задач.

📖 Почему это работает?
Метод "лягушки" получил поддержку в мире тайм-менеджмента благодаря фокусу на выполнении важных задач как первых шагов дня. Заканчивая мини-задачи, вы чувствуете прилив энергии, мотивации и уверенности. _Маленькие победы → Большой успех!_

💡 Примеры задач:
• _Сделать тот самый важный телефонный звонок_
• _Застелить кровать_
• _Потянуться 5 минут_
• _Разобрать рабочий стол_
• _Прочитать 1 страницу книги_

Начните с команды /create\_task (или кнопки *✏️ Создать Задачу* на клавиатуре), чтобы создать свою первую задачу.
"""

ALL_TASKS_COMPLETED_MESSAGE = """
🎉 Сегодня с задачами покончено, можно и зачиллиться
*Но не забудь запланировать новые на завтра!*
"""

NO_TASKS_FOUND_MESSAGE = """
По задачам пока пусто 🥸
Создать задачу можно с помощью команды /create_task или кнопкой на клавиатуре.
"""

TOO_MANY_TASKS_MESSAGE = """
*Время притормозить* 🐸

У тебя накопилось слишком много задач.
Пусть они и душные, но их выполнение принесет тебе огромное удовлетворение!
"""

TASK_REPLY_MESSAGE = """
{description}
"""